str_text = "Конкатенація (об'єднання) Python — операція склеювання об'єктів " \
           "лінійної структури, зазвичай рядків. Наприклад, конкатенація " \
           "слів «мікро» і «світ» дасть слово «мікросвіт». А, якщо обробити " \
           "необхідно курси валют за останні два роки? Тут нам на допомогу приходять списки. " \
           "Їх можна розглядати як аналог масиву в інших мовах програмування, за винятком важливої " \
           "особливості – списки в якості своїх елементів можуть містити будь-які об'єкти. " \
           "Але про все по порядку. Список (list) в Python є об'єктом (В Python все є об'єктами!!!), " \
           "тому його може бути присвоєно змінній (змінна, як і в попередніх випадках, " \
           "зберігає адресу об'єкта класу «список» Python )." \

list_text  = str_text.split() #переводим строку в список, роздільником виступає пробіл
set_text = set(list_text) #переводимо ліст в сет
set_by_char = set(str_text)
dict_text = {} #створюємо пустий словник

counter = 0
for set in set_text:
     for list in list_text:
         if set == list:
             counter += 1
             dict_text[set] = counter
     counter = 0


print(dict_text)
